{"config": [{"config": {"border_mode": "valid", "b_constraint": null, "name": "convolution2d_1", "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_dtype": "float32", "subsample": [1, 1], "activation": "linear", "batch_input_shape": [null, 1, 28, 28], "dim_ordering": "th", "nb_col": 3, "nb_filter": 32, "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "b_constraint": null, "name": "convolution2d_2", "b_regularizer": null, "trainable": true, "W_regularizer": null, "subsample": [1, 1], "activation": "linear", "dim_ordering": "th", "nb_col": 3, "nb_filter": 32, "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "dim_ordering": "th", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "name": "dense_1", "b_regularizer": null, "trainable": true, "W_regularizer": null, "output_dim": 128, "activation": "linear", "input_dim": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "name": "dense_2", "b_regularizer": null, "trainable": true, "W_regularizer": null, "output_dim": 10, "activation": "linear", "input_dim": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}