{"config": [{"config": {"batch_input_shape": [null, 1, 28, 28], "input_dtype": "float32", "trainable": true, "name": "zeropadding2d_1", "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"activity_regularizer": null, "name": "convolution2d_1", "border_mode": "valid", "trainable": true, "b_constraint": null, "b_regularizer": null, "nb_filter": 64, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_2", "trainable": true, "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"activity_regularizer": null, "name": "convolution2d_2", "border_mode": "valid", "trainable": true, "b_constraint": null, "b_regularizer": null, "nb_filter": 64, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "trainable": true, "strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_3", "trainable": true, "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"activity_regularizer": null, "name": "convolution2d_3", "border_mode": "valid", "trainable": true, "b_constraint": null, "b_regularizer": null, "nb_filter": 128, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_4", "trainable": true, "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"activity_regularizer": null, "name": "convolution2d_4", "border_mode": "valid", "trainable": true, "b_constraint": null, "b_regularizer": null, "nb_filter": 128, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_2", "trainable": true, "strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_5", "trainable": true, "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"activity_regularizer": null, "name": "convolution2d_5", "border_mode": "valid", "trainable": true, "b_constraint": null, "b_regularizer": null, "nb_filter": 256, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_6", "trainable": true, "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"activity_regularizer": null, "name": "convolution2d_6", "border_mode": "valid", "trainable": true, "b_constraint": null, "b_regularizer": null, "nb_filter": 256, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_3", "trainable": true, "strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "name": "dense_1", "trainable": true, "b_constraint": null, "b_regularizer": null, "output_dim": 4096, "W_regularizer": null, "bias": true, "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "activation": "relu"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "name": "dense_2", "trainable": true, "b_constraint": null, "b_regularizer": null, "output_dim": 10, "W_regularizer": null, "bias": true, "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}