{"class_name": "Sequential", "config": [{"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 1, 28, 28], "name": "zeropadding2d_1"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "name": "convolution2d_1", "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "relu", "dim_ordering": "th", "init": "glorot_uniform", "nb_filter": 64, "W_regularizer": null, "trainable": true, "subsample": [1, 1], "nb_row": 3, "W_constraint": null}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_2"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "name": "convolution2d_2", "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "relu", "dim_ordering": "th", "init": "glorot_uniform", "nb_filter": 64, "W_regularizer": null, "trainable": true, "subsample": [1, 1], "nb_row": 3, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_3"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "name": "convolution2d_3", "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "relu", "dim_ordering": "th", "init": "glorot_uniform", "nb_filter": 128, "W_regularizer": null, "trainable": true, "subsample": [1, 1], "nb_row": 3, "W_constraint": null}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_4"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "name": "convolution2d_4", "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "relu", "dim_ordering": "th", "init": "glorot_uniform", "nb_filter": 128, "W_regularizer": null, "trainable": true, "subsample": [1, 1], "nb_row": 3, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "name": "maxpooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_5"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "name": "convolution2d_5", "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "relu", "dim_ordering": "th", "init": "glorot_uniform", "nb_filter": 256, "W_regularizer": null, "trainable": true, "subsample": [1, 1], "nb_row": 3, "W_constraint": null}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_6"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "name": "convolution2d_6", "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "relu", "dim_ordering": "th", "init": "glorot_uniform", "nb_filter": 256, "W_regularizer": null, "trainable": true, "subsample": [1, 1], "nb_row": 3, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "name": "maxpooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Dense", "config": {"activation": "relu", "name": "dense_1", "input_dim": null, "bias": true, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 4096, "W_constraint": null, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "softmax", "name": "dense_2", "input_dim": null, "bias": true, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 10, "W_constraint": null, "trainable": true}}]}